aaron-bond.better-comments
budparr.language-hugo-vscode
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
donjayamanne.githistory
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
formulahendry.code-runner
golang.Go
ms-python.python
Prisma.vscode-graphql
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-turkish
