tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

#------------------------------------------------------------------------------#

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# UNIX shell (command interpreter)
brew "zsh" # This should have already been installed

# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"

# GNU File, Shell, and Text utilities
brew "coreutils"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Modern replacement for 'ls'
brew "exa"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep, but optimized for programmers
brew "ack"

# GNU version of the tar archiving utility
brew "gnu-tar"
# Compression and file packaging/archive utility
brew "zip"
# Extraction utility for .zip compressed archives
brew "unzip"

# Vi 'workalike' with many additional features
brew "vim"

# Distributed revision control system
brew "git"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"

# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Utility that provides fast incremental file transfer
brew "rsync"
# Internet file retriever
brew "wget"

#------------------------------------------------------------------------------#

# Platform built on V8 to build network applications
brew "node"

# Interpreted, interactive, object-oriented programming language
brew "python"
# Python dependency management tool
brew "pipenv"

# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Stylesheet Preprocessor
tap "dart-lang/dart"
tap "sass/sass"
brew "sass/sass/sass"

# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Object-relational database system
brew "postgresql", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

#------------------------------------------------------------------------------#

# Preview source code files with syntax highlighting
cask "qlcolorcode"
# Preview image size and resolution
cask "qlimagesize"
# Preview Markdown files
cask "qlmarkdown"
# Preview plain text files without or with unknown file extension
cask "qlstephen"

# AppCleaner is a small application remove leftovers from uninstalled apps
cask "appcleaner"
# 1Clipboard is a universal clipboard managing app
cask "1clipboard"
# The Unarchiver is a RAR extractor, and works with dozens of other formats
cask "the-unarchiver"

# Transmission is a BitTorrent client on top of a cross-platform back-end
cask "transmission"

# Visual Studio Code is a cross-platform source code editor
cask "visual-studio-code"
# TablePlus is an modern native SQL client and a database administration tool
cask "tableplus"
# FUSE extends macOS's native file system via third-party file systems
cask "osxfuse"
# Transmit is a file transfer client program for macOS. Developed by Panic
cask "transmit"
# Google Chrome is a freeware web browser developed by Google
cask "google-chrome"
# Postman is the only complete API development environment for API developers
cask "postman"
# ImageOptim makes images load faster
cask "imageoptim"

#------------------------------------------------------------------------------#

# Pages is a word processor developed
mas "com.apple.iWork.Pages", id: 409201541
# Numbers is a spreadsheet application developed
mas "com.apple.iWork.Numbers", id: 409203825
# Keynote is a presentation software application developed
mas "com.apple.iWork.Keynote", id: 409183694

# iMovie is a video editing software application sold
mas "com.apple.iMovieApp", id: 408981434

# Xcode is an integrated development environment for macOS developed
mas "com.apple.dt.Xcode", id: 497799835
